/*************************************************************************
Point3D.cpp
Point3D类的具体实现
zheng-y23 2024-7-27
*************************************************************************/

#include "Point3D.hpp"

/*************************************************************************
Point3D 
默认构造函数
无参数
无返回值
zheng-y23 2024-7-27
*************************************************************************/
Point3D::Point3D() {
    //空函数体
}

/*************************************************************************
Point3D
拷贝构造函数
Point3D常引用Source
无返回值
zheng-y23 2024-7-27
*************************************************************************/
Point3D::Point3D(const Point3D& Source) {
    SetComponent(Source.Component[0], Source.Component[1], Source.Component[2]);
}

/*************************************************************************
~Point3D
析构函数
无参数
无返回值
zheng-y23 2024-7-27
*************************************************************************/
Point3D::~Point3D() {
    //空函数体
}

/*************************************************************************
operator=
赋值运算符重载
Point3D常引用Source
赋值后对象
zheng-y23 2024-7-27
*************************************************************************/
Point3D& Point3D::operator= (const Point3D& Source) {
    if (this != &Source)
    {
        SetComponent(Source.Component[0], Source.Component[1], Source.Component[2]);
    }
    return *this;
}

/*************************************************************************
SetX
设置x坐标
double类型x
无返回值
zheng-y23 2024-7-27
*************************************************************************/
void Point3D::SetX(double x) {
    const double Comp[] = {x, Component[1], Component[2]};
    Vector<double, 3>::SetComponent(Comp);
}

/*************************************************************************
SetY
设置y坐标
double类型y
无返回值
zheng-y23 2024-7-27
*************************************************************************/
void Point3D::SetY(double y) {
    const double Comp[] = {Component[0], y, Component[2]};
    Vector<double, 3>::SetComponent(Comp);
}

/*************************************************************************
SetZ
设置z坐标
double类型z
无返回值
zheng-y23 2024-7-27
*************************************************************************/
void Point3D::SetZ(double z) {
    const double Comp[] = {Component[0], Component[1], z};
    Vector<double, 3>::SetComponent(Comp);
}

/*************************************************************************
SetComponent
设置坐标
double类型x, y, z
无返回值
zheng-y23 2024-7-27
*************************************************************************/
void Point3D::SetComponent(double x, double y, double z) {
    const double Comp[] = {x, y, z};
    Vector<double, 3>::SetComponent(Comp);
}